{
  "_name_or_path": "nvidia/mit-b0",
  "architectures": [
    "SegformerForSemanticSegmentation"
  ],
  "attention_probs_dropout_prob": 0.0,
  "classifier_dropout_prob": 0.1,
  "decoder_hidden_size": 256,
  "depths": [
    2,
    2,
    2,
    2
  ],
  "downsampling_rates": [
    1,
    4,
    8,
    16
  ],
  "drop_path_rate": 0.1,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_sizes": [
    32,
    64,
    160,
    256
  ],
  "id2label": {
    "0": "void",
    "1": "soil",
    "2": "sunflower",
    "3": "cornflower",
    "4": "corn_cockle",
    "5": "milk_thistle",
    "6": "rye_brome",
    "7": "small-flower_geranium"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "label2id": {
    "corn_cockle": 4,
    "cornflower": 3,
    "milk_thistle": 5,
    "rye_brome": 6,
    "small-flower_geranium": 7,
    "soil": 1,
    "sunflower": 2,
    "void": 0
  },
  "layer_norm_eps": 1e-06,
  "mlp_ratios": [
    4,
    4,
    4,
    4
  ],
  "model_type": "segformer",
  "num_attention_heads": [
    1,
    2,
    5,
    8
  ],
  "num_channels": 3,
  "num_encoder_blocks": 4,
  "patch_sizes": [
    7,
    3,
    3,
    3
  ],
  "reshape_last_stage": true,
  "semantic_loss_ignore_index": 255,
  "sr_ratios": [
    8,
    4,
    2,
    1
  ],
  "strides": [
    4,
    2,
    2,
    2
  ],
  "torch_dtype": "float32",
  "transformers_version": "4.33.1"
}
