{
  "_name_or_path": "nvidia/mit-b0",
  "architectures": [
    "SegformerForSemanticSegmentation"
  ],
  "attention_probs_dropout_prob": 0.0,
  "classifier_dropout_prob": 0.1,
  "decoder_hidden_size": 256,
  "depths": [
    2,
    2,
    2,
    2
  ],
  "downsampling_rates": [
    1,
    4,
    8,
    16
  ],
  "drop_path_rate": 0.1,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_sizes": [
    32,
    64,
    160,
    256
  ],
  "id2label": {
    "0": "void",
    "1": "soil",
    "2": "broad_bean",
    "3": "corn_spurry",
    "4": "red-root_amaranth",
    "5": "red_fingergrass",
    "6": "common_wild_oat",
    "7": "cornflower",
    "8": "corn_cockle",
    "9": "milk_thistle",
    "10": "rye_brome",
    "11": "narrow-leaved_plantain",
    "12": "small-flower_geranium"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "label2id": {
    "broad_bean": 2,
    "common_wild_oat": 6,
    "corn_cockle": 8,
    "corn_spurry": 3,
    "cornflower": 7,
    "milk_thistle": 9,
    "narrow-leaved_plantain": 11,
    "red-root_amaranth": 4,
    "red_fingergrass": 5,
    "rye_brome": 10,
    "small-flower_geranium": 12,
    "soil": 1,
    "void": 0
  },
  "layer_norm_eps": 1e-06,
  "mlp_ratios": [
    4,
    4,
    4,
    4
  ],
  "model_type": "segformer",
  "num_attention_heads": [
    1,
    2,
    5,
    8
  ],
  "num_channels": 3,
  "num_encoder_blocks": 4,
  "patch_sizes": [
    7,
    3,
    3,
    3
  ],
  "reshape_last_stage": true,
  "semantic_loss_ignore_index": 255,
  "sr_ratios": [
    8,
    4,
    2,
    1
  ],
  "strides": [
    4,
    2,
    2,
    2
  ],
  "torch_dtype": "float32",
  "transformers_version": "4.31.0"
}
